app/Controllers/Status.php

   public function index($id = null)
   {
      if ($id === null) {
         return view('pages/StatusProject/tampilStatus');
      } else {
         $data = $this->statusModel->find($id);
---
SELECT *
FROM `tb_status`
WHERE `tb_status`.`id` = 'GJFh'

   public function getDataStatus()
   {
      return json_encode($this->statusModel->findAll());
---
SELECT *
FROM `tb_status`

   public function sendDataStatus()
   {
      $id = $this->generateRandomStr(4);
      $status = $this->request->getPost();

      $data = [
         'id' => $id,
         'status' => $status
      ];
      $response = $this->statusModel->insert($data);
---
INSERT INTO `tb_status` (`id`, `status`) VALUES ('rIAo', ('selesai'))

   public function editDataStatus($id)
   {
      $id = $this->request->getPost('id');
      $data = [
         'status' => $this->request->getPost('status')
      ];

      $this->statusModel->update($id, $data);
---
UPDATE `tb_status` SET `status` = 'dasdsad'
WHERE `tb_status`.`id` IN ('GJFh')

   public function deleteDataStatus($id)
   {
      $result = $this->statusModel->delete($id);
---
DELETE FROM `tb_status`
WHERE `id` IN ('UUNP')